shan-hongzhi/MIOT-RTL8762E-B12G/vendor/xiaomi/mijia_ble_mesh/src/board/rtl8762e/main.c
/* light cwrgb channels, set pin_num to PIN_INVALID if do not use that color */
light_t light_cw[] =
{
    /** cold */
    {P2_4, TIM_PWM4, TIM4, TRUE, DEFAULT_LIGHTNESS, DEFAULT_LIGHTNESS},
    /** warm: set to actual pin*/
    {P2_5, TIM_PWM5, TIM5, TRUE, DEFAULT_LIGHTNESS, DEFAULT_LIGHTNESS},
};

static int GPIO_INPUT_HANDLER(int irq, void *context, void *arg)
{
    if (GPIO_GetINTStatus(GPIO_PIN_BUTTON_0)) {
        GPIO_INTConfig(GPIO_PIN_BUTTON_0, DISABLE);
        GPIO_MaskINTConfig(GPIO_PIN_BUTTON_0, ENABLE);

        printk("GPIO_INPUT_HANDLER %d\n", GPIO_ReadInputDataBit(GPIO_PIN_BUTTON_0));
        /* Config WakeUp pin */
        if (GPIO_ReadInputDataBit(GPIO_PIN_BUTTON_0)){
            printk("button release\n");
            static struct mible_task_item button_irq_tasklet;
            mible_single_task_post(&button_irq_tasklet, button_process_handler, NULL);

            GPIO->INTPOLARITY = GPIO->INTPOLARITY & (~GPIO_PIN_BUTTON_0);
        }else{
            printk("button press\n");
            GPIO->INTPOLARITY = (GPIO->INTPOLARITY & (~GPIO_PIN_BUTTON_0)) | GPIO_PIN_BUTTON_0;
        }
        GPIO_ClearINTPendingBit(GPIO_PIN_BUTTON_0);
        GPIO_MaskINTConfig(GPIO_PIN_BUTTON_0, DISABLE);
        GPIO_INTConfig(GPIO_PIN_BUTTON_0, ENABLE);
    }else{
        printk("GPIO_INPUT_HANDLER not BUTTON0\n");
    }

    return 0;
}

static int board_init(void)
{
    /* CONFIG GPIOS */
    for (uint8_t i = 0; i < sizeof(light_cw) / sizeof(light_t); ++i)
    {
        light_pin_config(&light_cw[i]);
    }

    /* CONFIG DIMMING */
    light_controller_init();

    /* INIT BUTTON IRQ*/
    RCC_PeriphClockCmd(APBPeriph_GPIO, APBPeriph_GPIO_CLOCK, ENABLE);

    Pad_Config(BUTTON_0, PAD_PINMUX_MODE, PAD_IS_PWRON, PAD_PULL_UP, PAD_OUT_DISABLE, PAD_OUT_HIGH);
    Pinmux_Config(BUTTON_0, DWGPIO);

    GPIO_InitTypeDef GPIO_struct_init;
    GPIO_StructInit(&GPIO_struct_init);

    GPIO_struct_init.GPIO_Pin = GPIO_PIN_BUTTON_0;
    GPIO_struct_init.GPIO_Mode = GPIO_Mode_IN;
    GPIO_struct_init.GPIO_DebounceTime = 10;
    GPIO_struct_init.GPIO_ITTrigger = GPIO_INT_Trigger_EDGE;
    GPIO_struct_init.GPIO_ITCmd = ENABLE;
    GPIO_struct_init.GPIO_ITDebounce = GPIO_INT_DEBOUNCE_ENABLE;
    GPIO_struct_init.GPIO_ITPolarity = GPIO_INT_POLARITY_ACTIVE_LOW;
    GPIO_Init(&GPIO_struct_init);

    NVIC_InitTypeDef NVIC_InitStruct;
    NVIC_InitStruct.NVIC_IRQChannel = GPIO_BUTTON0_IRQn;
    NVIC_InitStruct.NVIC_IRQChannelPriority = 3;
    NVIC_InitStruct.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStruct);

    GPIO_MaskINTConfig(GPIO_PIN_BUTTON_0, DISABLE);
    GPIO_INTConfig(GPIO_PIN_BUTTON_0, ENABLE);

    /* register nuttx IRQ*/
    extern void up_enable_irq(int irq);
    up_enable_irq(GPIO_Group2_VECTORn);
    irq_attach(GPIO_Group2_VECTORn, GPIO_INPUT_HANDLER, NULL);

    return 0;
}

static void light_reset_change_done(light_t *light)
{
    miio_system_reboot();
}

static void light_lightness_change_done(light_t *light)
{
    if(xiaomi_light.lightness > 0) {
        xiaomi_light.lightness_last = xiaomi_light.lightness;
    }
    xiaomi_light.lighttemp_last = xiaomi_light.lighttemp;

    printk("light_lightness_change_done lightness %d, temp %d\n",
        xiaomi_light.lightness_last, xiaomi_light.lighttemp_last);
}

int light_onoff_set(bool on)
{
    uint16_t bright_warm = CT2WARM_BRIGHTNESS(xiaomi_light.lighttemp_last,
                          xiaomi_light.lightness_last);
    uint16_t bright_cold = xiaomi_light.lightness_last - bright_warm;

    printk("light_onoff_set %d\n", on);
    // ioctl(gpio_fd, GPIOC_WRITE, on);

    xiaomi_light.light_on = on;

    if (on) {
        light_set_lightness_linear(&light_cw[0], bright_cold, 500, NULL);
        light_set_lightness_linear(&light_cw[1], bright_warm, 500, light_lightness_change_done);
        xiaomi_light.lightness = xiaomi_light.lightness_last;
    } else {
        light_set_lightness_linear(&light_cw[0], 0, 500, NULL);
        light_set_lightness_linear(&light_cw[1], 0, 500, light_lightness_change_done);
        xiaomi_light.lightness = 0;
    }

    return 0;
}

int light_lightness_set(uint16_t lightness)
{
    uint16_t bright_warm = CT2WARM_BRIGHTNESS(xiaomi_light.lighttemp,
                          lightness);
    uint16_t bright_cold = lightness - bright_warm;

    xiaomi_light.lightness = lightness;

    light_set_lightness_linear(&light_cw[0], bright_cold, 500, NULL);
    light_set_lightness_linear(&light_cw[1], bright_warm, 500, light_lightness_change_done);

    return 0;
}

int light_temperature_set(uint16_t lighttemp)
{
    uint16_t bright_warm = CT2WARM_BRIGHTNESS(lighttemp,
                          xiaomi_light.lightness);
    uint16_t bright_cold = xiaomi_light.lightness - bright_warm;

    xiaomi_light.lighttemp = lighttemp;

    light_set_lightness_linear(&light_cw[0], bright_cold, 500, NULL);
    light_set_lightness_linear(&light_cw[1], bright_warm, 500, light_lightness_change_done);

    return 0;
}

#include <../../subsys/bluetooth/host/conn_internal.h>
static void find_user_update_param_update(struct bt_conn *conn, void *data)
{
    if (conn->state == BT_CONN_CONNECTED)
    {
        struct bt_le_conn_param param;
        param.interval_min = 6;
        param.interval_max = 9;
        param.latency = 0;
        param.timeout = 400;
        int err;
        err = bt_conn_le_param_update(conn, &param);
        if (err) {
            printk( "conn update failed (err %d).", err);
        } else {
            printk("conn update initiated.");
        }
   }
}

static void user_update_param_update(void)
{
    bt_conn_foreach(BT_CONN_TYPE_ALL, find_user_update_param_update, NULL);
}

static void user_devinfo_callback(mible_dev_info_type_t type, mible_dev_info_t *buf)
{
    static const uint8_t support_devinfo[] = {
#if defined(CONFIG_MIBLE_USE_MCU_OTA)
        MIBLE_DEV_INFO_MCU_VERSION,
#endif
        MIBLE_DEV_INFO_HARDWARE_VERSION,
        MIBLE_DEV_INFO_NEW_SN,
    };

    switch (type) {
    case MIBLE_DEV_INFO_SUPPORT:
        buf->len = sizeof(support_devinfo);
        memcpy(buf->buff, support_devinfo, buf->len);
        break;
    case MIBLE_DEV_INFO_HARDWARE_VERSION:
        buf->len = strlen("MHCB12G");
        memcpy(buf->buff, "MHCB12G", buf->len);
        break;
    case MIBLE_DEV_INFO_NEW_SN:
        // maxlen 62
        buf->len = MIN(strlen("123456789/123456789/123456789/123456789/"
                      "123456789/123456789/12"), 62);
        memcpy(buf->buff,
               "123456789/123456789/123456789/123456789/123456789/"
               "123456789/12",
               buf->len);
        break;
    default:
        buf->code = MI_ERR_NOT_FOUND;
        return;
    }

    buf->code = MI_SUCCESS;

    return;
}

static void mible_conn_timeout_handler(void * arg)
{
    mible_status_t status;

    miio_timer_delete(conn_timer);
    conn_timer = NULL;

    if (is_logined == true) {
        return;
    }

