shan-hongzhi/MIOT-RTL8762E-B12G/vendor/xiaomi/mijia_ble_mesh/src/board/rtl8762e/main.c
    printk("mible conn timeout");

    status = mible_gap_disconnect(0);
    if (status) {
        printk("Unable disconnect %d", status);
    }
}

#if defined(CONFIG_MIBLE_USE_MCU_OTA)
void main_mcu_version_report_handler(void * arg)
{
    NET_BUF_SIMPLE_DEFINE(msg, 8);
    uint8_t mcu_ver[20];
    int status = 0;

    struct mible_mesh_msg_sent_ctx ctx_rsp = {
        .opcode = 0x00FF,
        .delay = 30,
        .dst = 0xFEFF,
        .mod_idx = 0,
    };

    net_buf_simple_add_u8(&msg, 0x06);
    net_buf_simple_add_u8(&msg, MIBLE_LIB_MAJOR);
    net_buf_simple_add_u8(&msg, MIBLE_LIB_MINOR);
    net_buf_simple_add_u8(&msg, MIBLE_LIB_REVISION);
    uint16_t dev_version = mi_config.cfg.dev_version;
    net_buf_simple_add_u8(&msg, (uint8_t)(dev_version&0x00ff));
    net_buf_simple_add_u8(&msg, (uint8_t)((dev_version>>8)&0xff));
    net_buf_simple_add_u8(&msg, mi_config.cfg.mcu_version[0]);
    net_buf_simple_add_u8(&msg, mi_config.cfg.mcu_version[1]);

    status = mible_mesh_msg_send(&ctx_rsp, &msg);
    printk("report mcu version err %d,msg len %d, size %d\n", status, msg.len, msg.size);
}

uint32_t main_rand(uint32_t down, uint32_t up)
{
    uint32_t val, diff = up - down;
    int err;

    err = bt_rand(&val, sizeof(val));
    if (err) {
        return down;
    }

    return down + (val % diff);
}

void main_mcu_version_report(void)
{
    uint32_t random = main_rand(20,30);
    printk("MCU version report after random:%ld(s)\n",random);
    uint32_t start_timeout = random * 1000;
    if(mcu_ver_report_timer !=NULL){
        miio_timer_start(mcu_ver_report_timer, start_timeout, NULL);
    }
}
#endif

static void user_event_cb(mible_user_event_type_t event, void *user_data)
{
    static const uint8_t *const strs[] = {
        [MIBLE_USER_PROV_CB_TYPE_UNPROV] = "Unprovision",
        [MIBLE_USER_PROV_CB_TYPE_PROVED] = "Provisioned",
        [MIBLE_USER_PROV_CB_TYPE_START] = "Provision start",
        [MIBLE_USER_PROV_CB_TYPE_COMPLETE] = "Provision completed",
        [MIBLE_USER_PROV_CB_TYPE_FAIL] = "Provision failed",
        [MIBLE_USER_PROV_CB_TYPE_RESET] = "Provision Reseted",
        [MIBLE_USER_PROV_CB_TYPE_RECOVERY] = "Provision Recoveried",
        [MIBLE_USER_LOGIN_CB_TYPE_START] = "Login start",
        [MIBLE_USER_LOGIN_CB_TYPE_COMPLETE] = "Login completed",
        [MIBLE_USER_LOGIN_CB_TYPE_FAIL] = "Login failed",
        [MIBLE_USER_GAP_CB_CONNECTED] = "Connected",
        [MIBLE_USER_GAP_CB_DISCONNECTED] = "Disconnected",
        [MIBLE_USER_SCENE_CB_ADD] = "Scene added",
        [MIBLE_USER_SCENE_CB_DELETE] = "Scene deleted",
        [MIBLE_USER_SCENE_CB_RECALL] = "Scene recalled",
    };

    if (event >= ARRAY_SIZE(strs)) {
        return;
    }

    printk("%s\n", strs[event]);
    switch (event)
    {
    case MIBLE_USER_PROV_CB_TYPE_UNPROV:
        printk("MIBLE_USER_PROV_CB_TYPE_UNPROV\n");
        is_provisioned = false;
        //mible_mesh_device_scan_set(MESH_SCAN_FULL);
        //miio_system_set_adv_timeout(1800000); // stop adv after 30min
        break;
    case MIBLE_USER_PROV_CB_TYPE_FAIL:
        is_provisioned = false;
        break;
    case MIBLE_USER_PROV_CB_TYPE_START:
        break;
    case MIBLE_USER_PROV_CB_TYPE_RECOVERY:
    case MIBLE_USER_PROV_CB_TYPE_COMPLETE:
    {
        is_provisioned = true;
        xiaomi_light.light_on = true;
        light_onoff_set(xiaomi_light.light_on);
        {
            int bright_warm = CT2WARM_BRIGHTNESS(xiaomi_light.lighttemp, xiaomi_light.lightness);
            int bright_cold = xiaomi_light.lightness_last - bright_warm;
            light_breath(&light_cw[0], 0, bright_cold, 500, 50, 3, true, NULL);
            light_breath(&light_cw[1], 0, bright_warm, 500, 50, 3, true, NULL);
        }
        //keep adv always on
        miio_system_set_adv_timeout(0xFFFFFFFF);
#if TEST_GATT_SPEC
        miio_mesh_properties_period_publish_init(3, 1, 0);
        miio_mesh_properties_period_publish_init(3, 2, 0);
#endif
#if defined(CONFIG_MIBLE_USE_MCU_OTA)
        main_mcu_version_report();
#endif
    }break;
    case MIBLE_USER_PROV_CB_TYPE_PROVED:
        if (reset_timer) {
            break;
        }
        is_provisioned = true;
        xiaomi_light.light_on = true;
        light_onoff_set(xiaomi_light.light_on);
        //keep adv always on
        miio_system_set_adv_timeout(0xFFFFFFFF);
#if TEST_GATT_SPEC
        miio_mesh_properties_period_publish_init(3, 1, 0);
        miio_mesh_properties_period_publish_init(3, 2, 0);
#endif
#if defined(CONFIG_MIBLE_USE_MCU_OTA)
        main_mcu_version_report();
#endif
        break;
    case MIBLE_USER_PROV_CB_TYPE_RESET:{
        bool *reboot = user_data;
        *reboot = false;
        light_breath(&light_cw[0], 0, 30000, 1000, 50, 3, false, NULL);
        light_breath(&light_cw[1], 0, 30000, 1000, 50, 3, false, light_reset_change_done);
    }break;
    case MIBLE_USER_GAP_CB_CONNECTED:
    {
        int err;

        err = miio_timer_create(&conn_timer,
                        mible_conn_timeout_handler,
                        MIBLE_TIMER_SINGLE_SHOT);
        if (err) {
            printk("Unable create conn timeout timer");
        } else {
            miio_timer_start(conn_timer, 20000, NULL);
        }

        is_connected = true;
        is_logined = false;

        user_update_param_update();
    } break;
    case MIBLE_USER_GAP_CB_DISCONNECTED:
    {
        if (conn_timer) {
            miio_timer_delete(conn_timer);
            conn_timer = NULL;
        }

        is_connected = false;
    } break;
    case MIBLE_USER_LOGIN_CB_TYPE_COMPLETE:
    {
        is_logined = true;
    } break;
    case MIBLE_USER_SCENE_CB_ADD:
    {
        //Confirmed subscribe 0xFEFE
        extern struct bt_mesh_elem elements[];
        struct bt_mesh_model *mod = &elements[0].vnd_models[0];

        uint16_t *entry = bt_mesh_model_find_group(&mod, MIBLE_MESH_DEVICE_GROUP);
        if(entry == NULL){
            entry = bt_mesh_model_find_group(&mod, BT_MESH_ADDR_UNASSIGNED);
            if(entry){
                *entry = MIBLE_MESH_DEVICE_GROUP;
                if (IS_ENABLED(CONFIG_BT_SETTINGS)) {
                    bt_mesh_model_sub_store(mod);
                }
                printk("success sub dev group addr %04x!!\n", MIBLE_MESH_DEVICE_GROUP);
            }
        }
    }break;
    default:
        break;
    }
    return;
}

