shan-hongzhi/MIOT-RTL8762E-B12G/vendor/xiaomi/mijia_ble_mesh/src/board/rtl8762e/main.c
static void dfu_event_cb(mible_dfu_state_t state, const mible_dfu_param_t *param)
{
    static const uint8_t *const strs[] = {
        [MIBLE_DFU_STATE_START] = "Start",
        [MIBLE_DFU_STATE_UPGRADE_STATUS] = "Upgrade Status",
        [MIBLE_DFU_STATE_TRANSFER] = "Transfer",
        [MIBLE_DFU_STATE_VERIFY] = "Verify",
        [MIBLE_DFU_STATE_SWITCH] = "Switch",
        [MIBLE_DFU_STATE_PROCESS] = "Process Report",
        [MIBLE_DFU_STATE_CANCEL] = "Cancel",
    };

    mible_dfu_param_t *p_dfu = (mible_dfu_param_t *)param;

    if (state >= ARRAY_SIZE(strs)) {
        return;
    }else if(state == MIBLE_DFU_STATE_UPGRADE_STATUS){
        p_dfu->upgrade_status.rsp = p_dfu->upgrade_status.req;
        printk("Req silent %d, install %d, Rsp silent %d, install %d\n", 
            p_dfu->upgrade_status._req.silent, p_dfu->upgrade_status._req.install,
            p_dfu->upgrade_status._rsp.silent, p_dfu->upgrade_status._rsp.install);
    }else if(state == MIBLE_DFU_STATE_VERIFY){
        printk("verify result is %d, version %u.%u.%u_%04u\n", p_dfu->verify.value,
            p_dfu->verify.version.major, p_dfu->verify.version.minor, 
            p_dfu->verify.version.revision, p_dfu->verify.version.build);
        //TODO: p_dfu->verify.value return MIBLE_DFU_STATUS_ERR_INVALID_VERSION when verion is old
    }

    printk("DFU %s\n", strs[state]);
}

static void P_1_1_Manufacturer_doGet(mible_spec_bearer_t bearer, mible_spec_property_operation_t *o)
{
}

static void P_1_2_Model_doGet(mible_spec_bearer_t bearer, mible_spec_property_operation_t *o)
{
}

static void P_1_3_SerialNumber_doGet(mible_spec_bearer_t bearer, mible_spec_property_operation_t *o)
{
}

static void P_1_4_FirmwareRevision_doGet(mible_spec_bearer_t bearer,
                     mible_spec_property_operation_t *o)
{
}

static void P_2_1_On_doGet(mible_spec_bearer_t bearer, mible_spec_property_operation_t *o)
{
    mible_spec_property_value_new_boolean(&o->value, xiaomi_light.light_on);
}

static void P_2_2_Brightness_doGet(mible_spec_bearer_t bearer, mible_spec_property_operation_t *o)
{
    mible_spec_property_value_new_ushort(&o->value, xiaomi_light.lightness);
}

static void P_2_3_ColorTemperature_doGet(mible_spec_bearer_t bearer,
                     mible_spec_property_operation_t *o)
{
    mible_spec_property_value_new_ushort(&o->value, xiaomi_light.lighttemp);
}

static void P_2_1_On_doSet(mible_spec_bearer_t bearer, mible_spec_property_operation_t *o)
{
    if (o->value.format != MIBLE_SPEC_PROPERTY_FORMAT_BOOL)
    {
        o->code = MIBLE_SPEC_OPERATION_ERROR_VALUE;
        return;
    }

    light_onoff_set(o->value.data.boolean);

    o->code = MIBLE_SPEC_OPERATION_OK;
}

static void P_2_2_Brightness_doSet(mible_spec_bearer_t bearer, mible_spec_property_operation_t *o)
{
    if (o->value.format != MIBLE_SPEC_PROPERTY_FORMAT_USHORT && o->value.format != MIBLE_SPEC_PROPERTY_FORMAT_NUMBER)
    {
        o->code = MIBLE_SPEC_OPERATION_ERROR_VALUE;
        return;
    }

    light_lightness_set(o->value.data.ushortValue);

    o->code = MIBLE_SPEC_OPERATION_OK;
}

static void P_2_3_ColorTemperature_doSet(mible_spec_bearer_t bearer,
                     mible_spec_property_operation_t *o)
{
    if (o->value.format != MIBLE_SPEC_PROPERTY_FORMAT_ULONG && o->value.format != MIBLE_SPEC_PROPERTY_FORMAT_NUMBER)
    {
        o->code = MIBLE_SPEC_OPERATION_ERROR_VALUE;
        return;
    }

    light_temperature_set(o->value.data.ulongValue);

    o->code = MIBLE_SPEC_OPERATION_OK;
}

static void P_2_1_On_doAction(mible_spec_bearer_t bearer, mible_spec_action_operation_t *o)
{
    mible_spec_property_value_t value;

    if(xiaomi_light.light_on){
        xiaomi_light.light_on = false;
    }else{
        xiaomi_light.light_on = true;
    }
    light_onoff_set(xiaomi_light.light_on);

    mible_spec_property_value_new_boolean(&value, xiaomi_light.light_on);
    miio_mesh_properties_changed(2, 1, &value);

    o->vals.size = 0;
    o->code = MIBLE_SPEC_OPERATION_OK;
}

static void P_128_1_GMT_Offset_doSet(mible_spec_bearer_t bearer, mible_spec_property_operation_t *o)
{
}

static void P_128_2_Weather_doSet(mible_spec_bearer_t bearer, mible_spec_property_operation_t *o)
{
}

static void P_128_3_UTC_Time_doSet(mible_spec_bearer_t bearer, mible_spec_property_operation_t *o)
{
}

#if TEST_GATT_SPEC
const char *str1 = "Hi, Susan, We re throwing a surprise party for Xiaomings birthday. \
As scheduled, all the classmates in our class will gather at the Students  Centre at \
8 pm this Friday evening to celebrate Xiaoming s birthday. We would feel much honored \
if you could come and enjoy it, which is to finish at 9, lasting an hour. As the party \
starts, we will light the candles and sing Happy Birthday for him. Then the birthday \
cake will be presented and cut for all of us to enjoy, following which we ll sing songs \
and play some small games. What s more, as a surprise, we ll all prepare some secret \
birthday gifts for him, and it ll be great to see how surprised he will be seeing the \
gifts. As it s a surprise party, he will know nothing about it beforehand, and we do hope\
that you could manage to attend it. Looking forward to your coming. Yours Li Hua";

void gatt_prop()
{
    int ret;
    if(is_connected){
        mible_spec_property_t Props;
        Props.siid = 1;Props.piid = 2; 
        mible_spec_property_value_new_uchar(&Props.value, 80);
        miio_gatt_properties_changed(1, &Props);

        Props.siid = 2;Props.piid = 4; 
        mible_spec_property_value_new_float(&Props.value, -12.3f);
        miio_gatt_properties_changed(1, &Props);

        Props.siid = 3;Props.piid = 6; 
        mible_spec_property_value_new_string(&Props.value, "abcdefg1234567!");
        miio_gatt_properties_changed(1, &Props);


        mible_spec_property_t newProps[5];
        newProps[0].siid = 1;newProps[0].piid = 2; 
        mible_spec_property_value_new_uchar(&newProps[0].value, 80);
        newProps[1].siid = 1;newProps[1].piid = 2; 
        mible_spec_property_value_new_uchar(&newProps[1].value, 100);
        newProps[2].siid = 2;newProps[2].piid = 4; 
        mible_spec_property_value_new_float(&newProps[2].value, -12.3f);
        newProps[3].siid = 2;newProps[3].piid = 4; 
        mible_spec_property_value_new_float(&newProps[3].value, 23.4f);
        newProps[4].siid = 3;newProps[4].piid = 6; 
        mible_spec_property_value_new_string(&newProps[4].value, str1);
        ret = miio_gatt_properties_changed(5, newProps);
        printk("%s[%d]ret=%d strlen(str1)=%d\n", __FUNCTION__, __LINE__, ret, strlen(str1));
    }
}

void gatt_event()
{
    if(is_connected){
        //5-1006 Door Ring
        miio_gatt_event_occurred(5, 1006, NULL);
        //2-1007 Lock abnormal
        mible_spec_arguments_t newArgs;
        mible_spec_argument_t arguments[2];
        newArgs.size = 2;
        newArgs.arguments = arguments;
        arguments[0].piid = 4;
        mible_spec_property_value_new_uchar(&arguments[0].value, 3);
        arguments[1].piid = 6;
        mible_spec_property_value_new_string(&arguments[1].value, "abcdefghijklmnopqrstuvwxyz1234567890!!!");
        miio_gatt_event_occurred(2, 1007, &newArgs);
    }
}

static char str2[64] = "string test ok!!!";

