shan-hongzhi/MIOT-RTL8762E-B12G/vendor/xiaomi/mijia_ble_mesh/src/board/rtl8762e/main.c
static struct {
    bool        s_bool;
    uint8_t     s_uchar;
    uint16_t    s_ushort;
    uint32_t    s_ulong;
    int8_t      s_char;
    int16_t     s_short;
    int32_t     s_long;
    float       s_float;
    int64_t     s_longlong;
    char        *s_string;
    int         s_strlen;
} data_type_test = {
    .s_float = 0.0,
    .s_string = str2,
    .s_strlen = 18,
};

static void P_3_1_doGet(mible_spec_bearer_t bearer, mible_spec_property_operation_t *o)
{
    mible_spec_property_value_new_boolean(&o->value, data_type_test.s_bool);
}

static void P_3_2_doGet(mible_spec_bearer_t bearer, mible_spec_property_operation_t *o)
{
    mible_spec_property_value_new_uchar(&o->value, data_type_test.s_uchar);
}

static void P_3_3_doGet(mible_spec_bearer_t bearer, mible_spec_property_operation_t *o)
{
    mible_spec_property_value_new_ushort(&o->value, data_type_test.s_ushort);
}

static void P_3_4_doGet(mible_spec_bearer_t bearer, mible_spec_property_operation_t *o)
{
    mible_spec_property_value_new_ulong(&o->value, data_type_test.s_ulong);
}

static void P_3_5_doGet(mible_spec_bearer_t bearer, mible_spec_property_operation_t *o)
{
    mible_spec_property_value_new_char(&o->value, data_type_test.s_char);
}

static void P_3_6_doGet(mible_spec_bearer_t bearer, mible_spec_property_operation_t *o)
{
    mible_spec_property_value_new_short(&o->value, data_type_test.s_short);
}

static void P_3_7_doGet(mible_spec_bearer_t bearer, mible_spec_property_operation_t *o)
{
    mible_spec_property_value_new_long(&o->value, data_type_test.s_long);
}

static void P_3_8_doGet(mible_spec_bearer_t bearer, mible_spec_property_operation_t *o)
{
    // mible_spec_property_value_new_float(&o->value, data_type_test.s_float);
    o->code = MIBLE_SPEC_OPERATION_INVALID;
}

static void P_3_9_doGet(mible_spec_bearer_t bearer, mible_spec_property_operation_t *o)
{
    if(bearer != MIBLE_SPEC_BEARER_GATT){
        o->code = MIBLE_SPEC_OPERATION_INVALID;
        return;
    }
    mible_spec_property_value_new_longlong(&o->value, data_type_test.s_longlong);
}

static void P_3_10_doGet(mible_spec_bearer_t bearer, mible_spec_property_operation_t *o)
{
    if(bearer != MIBLE_SPEC_BEARER_GATT){
        o->code = MIBLE_SPEC_OPERATION_INVALID;
        return;
    }
    mible_spec_property_value_new_nstring(&o->value, data_type_test.s_string, data_type_test.s_strlen);
}

static void P_3_1_doSet(mible_spec_bearer_t bearer, mible_spec_property_operation_t *o)
{
    data_type_test.s_bool = o->value.data.boolean;
    o->code = MIBLE_SPEC_OPERATION_OK;
}

static void P_3_2_doSet(mible_spec_bearer_t bearer, mible_spec_property_operation_t *o)
{
    data_type_test.s_uchar = o->value.data.ucharValue;
    o->code = MIBLE_SPEC_OPERATION_OK;
}

static void P_3_3_doSet(mible_spec_bearer_t bearer, mible_spec_property_operation_t *o)
{
    data_type_test.s_ushort = o->value.data.ushortValue;
    o->code = MIBLE_SPEC_OPERATION_OK;
}

static void P_3_4_doSet(mible_spec_bearer_t bearer, mible_spec_property_operation_t *o)
{
    data_type_test.s_ulong = o->value.data.ulongValue;
    o->code = MIBLE_SPEC_OPERATION_OK;
}

static void P_3_5_doSet(mible_spec_bearer_t bearer, mible_spec_property_operation_t *o)
{
    data_type_test.s_char = o->value.data.charValue;
    o->code = MIBLE_SPEC_OPERATION_OK;
}

static void P_3_6_doSet(mible_spec_bearer_t bearer, mible_spec_property_operation_t *o)
{
    data_type_test.s_short = o->value.data.shortValue;
    o->code = MIBLE_SPEC_OPERATION_OK;
}

static void P_3_7_doSet(mible_spec_bearer_t bearer, mible_spec_property_operation_t *o)
{
    data_type_test.s_long = o->value.data.longValue;
    o->code = MIBLE_SPEC_OPERATION_OK;
}

static void P_3_8_doSet(mible_spec_bearer_t bearer, mible_spec_property_operation_t *o)
{
    data_type_test.s_float = o->value.data.floatValue;
    // o->code = MIBLE_SPEC_OPERATION_OK;
    o->code = MIBLE_SPEC_OPERATION_INVALID;
}

static void P_3_9_doSet(mible_spec_bearer_t bearer, mible_spec_property_operation_t *o)
{
    if(bearer != MIBLE_SPEC_BEARER_GATT){
        o->code = MIBLE_SPEC_OPERATION_INVALID;
        return;
    }
    data_type_test.s_longlong = o->value.data.longlongValue;
    o->code = MIBLE_SPEC_OPERATION_OK;
}

static void P_3_10_doSet(mible_spec_bearer_t bearer, mible_spec_property_operation_t *o)
{
    if(bearer != MIBLE_SPEC_BEARER_GATT){
        o->code = MIBLE_SPEC_OPERATION_INVALID;
        return;
    }
    
    if(o->value.data.string.length >= sizeof(str2)){
        o->code = MIBLE_SPEC_OPERATION_ERROR_VALUE;
        return;
    }
    
    data_type_test.s_strlen = o->value.data.string.length;
    memcpy(data_type_test.s_string, o->value.data.string.str, o->value.data.string.length);
    o->code = MIBLE_SPEC_OPERATION_OK;
}
#endif

static void button_process_handler(void *args)
{
    struct mallinfo info;
    printk("button pressed!\n");

#if defined(CONFIG_MIBLE_HAVE_MSC)
    msc_self_test();
#endif

    // mible_gap_user_noconn_adv_start(20, 8, ad, ARRAY_SIZE(ad));

    xiaomi_light.light_on = xiaomi_light.light_on? false:true;
    light_onoff_set(xiaomi_light.light_on);

    if(is_provisioned){
        mible_spec_property_value_t value;
        mible_spec_property_value_new_boolean(&value, xiaomi_light.light_on);
        mible_mesh_send_property_changed(2, 1, &value);

#if TEST_GATT_SPEC
        gatt_prop();
        gatt_event();
#endif
    }
}

MIBLE_SPEC_DEFINE(spec_handlers)
    MIBLE_SPEC_SIID_START(1)
        MIBLE_SPEC_HANDLER(1, P_1_1_Manufacturer_doGet, NULL, NULL),
        MIBLE_SPEC_HANDLER(2, P_1_2_Model_doGet, NULL, NULL),
        MIBLE_SPEC_HANDLER(3, P_1_3_SerialNumber_doGet, NULL, NULL),
        MIBLE_SPEC_HANDLER(4, P_1_4_FirmwareRevision_doGet, NULL, NULL),
    MIBLE_SPEC_SIID_END

    MIBLE_SPEC_SIID_START(2)
        MIBLE_SPEC_HANDLER(1, P_2_1_On_doGet, P_2_1_On_doSet, P_2_1_On_doAction),
        MIBLE_SPEC_HANDLER(2, P_2_2_Brightness_doGet, P_2_2_Brightness_doSet, NULL),
        MIBLE_SPEC_HANDLER(3, P_2_3_ColorTemperature_doGet, P_2_3_ColorTemperature_doSet, NULL),
    MIBLE_SPEC_SIID_END

