shan-hongzhi/MIOT-RTL8762E-B12G/vendor/xiaomi/mijia_ble_mesh/src/board/rtl8762e/main.c
#if TEST_GATT_SPEC
    MIBLE_SPEC_SIID_START(3)
        MIBLE_SPEC_HANDLER(1, P_3_1_doGet, P_3_1_doSet, NULL),
        MIBLE_SPEC_HANDLER(2, P_3_2_doGet, P_3_2_doSet, NULL),
        MIBLE_SPEC_HANDLER(3, P_3_3_doGet, P_3_3_doSet, NULL),
        MIBLE_SPEC_HANDLER(4, P_3_4_doGet, P_3_4_doSet, NULL),
        MIBLE_SPEC_HANDLER(5, P_3_5_doGet, P_3_5_doSet, NULL),
        MIBLE_SPEC_HANDLER(6, P_3_6_doGet, P_3_6_doSet, NULL),
        MIBLE_SPEC_HANDLER(7, P_3_7_doGet, P_3_7_doSet, NULL),
        MIBLE_SPEC_HANDLER(8, P_3_8_doGet, P_3_8_doSet, NULL),
        MIBLE_SPEC_HANDLER(9, P_3_9_doGet, P_3_9_doSet, NULL),
        MIBLE_SPEC_HANDLER(10, P_3_10_doGet, P_3_10_doSet, NULL),
    MIBLE_SPEC_SIID_END
#endif

    MIBLE_SPEC_SIID_START(128)
        MIBLE_SPEC_HANDLER(1, NULL, P_128_1_GMT_Offset_doSet, NULL),
        MIBLE_SPEC_HANDLER(2, NULL, P_128_2_Weather_doSet, NULL),
        MIBLE_SPEC_HANDLER(3, NULL, P_128_3_UTC_Time_doSet, NULL),
    MIBLE_SPEC_SIID_END
MIBLE_SPEC_END

static const struct mible_spec_piid_or_aiid_list *
    find_spec_handler(uint16_t siid, uint16_t piid_or_aiid)
{
    int i, j;

    for (i = 0; i < ARRAY_SIZE(spec_handlers); i++) {
        if (spec_handlers[i].siid == siid) {
            break;
        }
    }

    if (i == ARRAY_SIZE(spec_handlers)) {
        return NULL;
    }

    for (j = 0; spec_handlers[i].lists[j].piid_or_aiid != 0; j++) {
        if (spec_handlers[i].lists[j].piid_or_aiid == piid_or_aiid) {
            break;
        }
    }

    if (spec_handlers[i].lists[j].piid_or_aiid == 0) {
        return NULL;
    }

    return &spec_handlers[i].lists[j];
}

static const uint8_t *const spec_bearers[] = {
    [MIBLE_SPEC_BEARER_GATT] = "[GATT]",
    [MIBLE_SPEC_BEARER_MESH] = "[MESH]",
};

static void do_spec_get(mible_spec_bearer_t bearer, mible_spec_property_operation_t *o)
{
    const struct mible_spec_piid_or_aiid_list *i;

    if (bearer >= ARRAY_SIZE(spec_bearers)) {
        return;
    }

    printk("%s %s siid %d piid %d\n", __FUNCTION__, spec_bearers[bearer], o->siid, o->piid);

    i = find_spec_handler(o->siid, o->piid);
    if (!i || !(i->get)) {
        return;
    }

    i->get(bearer, o);
}

static void do_spec_set(mible_spec_bearer_t bearer, mible_spec_property_operation_t *o)
{
    const struct mible_spec_piid_or_aiid_list *i;

    if (bearer >= ARRAY_SIZE(spec_bearers)) {
        return;
    }

    printk("%s %s siid %d piid %d type %d val %08lx\n", __FUNCTION__, spec_bearers[bearer], 
            o->siid, o->piid, o->value.format, o->value.data.ulongValue);

    i = find_spec_handler(o->siid, o->piid);
    if (!i || !(i->set)) {
        return;
    }

    i->set(bearer, o);
}

static void do_spec_invoke(mible_spec_bearer_t bearer, mible_spec_action_operation_t *o)
{
    const struct mible_spec_piid_or_aiid_list *i;

    if (bearer >= ARRAY_SIZE(spec_bearers)) {
        return;
    }

    printk("%s %s siid %d piid %d arg[size %d]\n", __FUNCTION__, spec_bearers[bearer], o->siid, o->aiid,
           o->vals.size);

    i = find_spec_handler(o->siid, o->aiid);
    if (!i || !(i->invoke)) {
        return;
    }

    i->invoke(bearer, o);
}

#define APP_CFG_INFO __attribute__((section(".cfg"))) __attribute__((used))
const volatile struct mible_config APP_CFG_INFO mi_config = {
    .magic = 0xdeadbeef,
    .cfg =
    {
        .pid = PRODUCT_ID,
        .dev_version = DEVELOPER_VERSION,
        .model_name = MODEL_NAME,
#if defined(CONFIG_MIBLE_USE_MCU_OTA)
        .mcu_version = mcu_version_buffer,
#endif
        .gatt_spec =
        {
            .rx_buf = gatt_spec_buffer,
            .max_rx_buf_len = ARRAY_SIZE(gatt_spec_buffer),
            .max_tx_buf_len = ARRAY_SIZE(gatt_spec_buffer),
            .tx_pool = gatt_spec_pool,
            .max_tx_pool_num = ARRAY_SIZE(gatt_spec_pool),
        },

        .init = 
        {
            .gatt_spec_init = mible_gatt_spec_enable,
        #if defined(CONFIG_BT_MESH_PSK)
            .psk_init = mible_psk_auth_enable,
        #endif
        #if defined(CONFIG_BT_MESH_PATH)
            .path_init = mible_path_ota_enable,
        #endif
        #if defined(CONFIG_MIBLE_USE_MCU_OTA)
            .mcu_ota_init = mible_dfu_mcu_ota_enable,
        #endif
        },
    },
    .cb =
    {
        .dev_info.req = user_devinfo_callback,
        .event.event = user_event_cb,
        .dfu_info.event = dfu_event_cb,
        .spec.get = do_spec_get,
        .spec.set = do_spec_set,
        .spec.invoke = do_spec_invoke,
    },
};

uint32_t scan_count, ext_adv_cnt, lost_cnt, per_adv_cnt;

static void scan_recv(const struct bt_le_scan_recv_info *info,
            struct net_buf_simple *buf)
{
    scan_count++;
    if(info->adv_type == BT_GAP_ADV_TYPE_EXT_ADV){
        ext_adv_cnt++;
    }
}

static struct bt_le_scan_cb ext_scan_cb = {
    .recv = scan_recv,
};

static void pwr_timer_handler(void * p_context)
{
    int err;
    uint32_t pwr_cnt;

    if (!p_context) {
        miio_timer_delete(pwn_timer);
        pwn_timer = NULL;

        err = miio_record_delete(RECORD_ID_POWER_ON_COUNT);
        if (err) {
            printk("Unable to delete recoid id:0x%04x",
                      RECORD_ID_POWER_ON_COUNT);
        }

        return;
    }

    pwr_cnt = (uint32_t)p_context;

    miio_timer_start(pwn_timer, SWITCH_POWER_ON_TIME, NULL);

    err = miio_record_write(RECORD_ID_POWER_ON_COUNT,
                (uint8_t *)&pwr_cnt, sizeof(pwr_cnt));
    if (err) {
        printk("Unable to store recoid id:0x%04x",
                  RECORD_ID_POWER_ON_COUNT);
    }
}

static bool light_flash_restore(void)
{
    uint32_t pwr_cnt = 0;
    int ret;

    ret = miio_record_read(RECORD_ID_POWER_ON_COUNT,
                   (uint8_t *)&pwr_cnt, sizeof(pwr_cnt));
    if (ret != MI_SUCCESS) {
        goto store;
    }

    printk("Power on count %ld\n", pwr_cnt);

    if (pwr_cnt >= SWITCH_POWER_ON_COUNT) {
        return true;
    }

store:
    pwr_cnt++;

    ret = miio_timer_create(&pwn_timer,
                pwr_timer_handler,
                MIBLE_TIMER_SINGLE_SHOT);
    if (ret) {
        printk("Unable to create timer for power reset");
        return false;
    }

