shan-hongzhi/MIOT-RTL8762E-B12G/vendor/xiaomi/mijia_ble_mesh/src/board/rtl8762e/main.c
    miio_timer_start(pwn_timer, 1000, (void *)pwr_cnt);

    return false;
}

static void node_restore_timer_handler(void * arg)
{
    int err;

    err = miio_record_delete(RECORD_ID_POWER_ON_COUNT);
    if (err) {
        printk("Unable to delete recoid id:0x%04x",
                  RECORD_ID_POWER_ON_COUNT);
    }

    //use param 0 to close recovery
    mible_mesh_restore(0);
}

static void app_periodic_handler(void * arg)
{
    struct mallinfo info;
    int err = 0;

    info = mallinfo();
    printk("Heap left:%d Scan cnt:%ld, ext cnt:%ld, per cnt %ld\n",
        info.fordblks, scan_count, ext_adv_cnt, per_adv_cnt);

    scan_count = 0;
    ext_adv_cnt = 0;
    per_adv_cnt = 0;

    err = ioctl(fd_wd, WDIOC_KEEPALIVE, 0);
    if(err < 0){
        printk("wd feed fail %d\n", err);
    }
}

/* Used for factory test */
typedef struct {
    uint8_t major;
    uint8_t minor;
    uint8_t revision;
    uint8_t padding;
    uint16_t developer_version;

    uint16_t  p;
    const uint8_t   *m;

    uint32_t magic;
} info_t;

#define APP_VERSION_INFO __attribute__((section(".info"))) __attribute__((used))

const info_t mi_info APP_VERSION_INFO = {
    .major = MIBLE_LIB_MAJOR,
    .minor = MIBLE_LIB_MINOR,
    .revision = MIBLE_LIB_REVISION,
    .developer_version = DEVELOPER_VERSION,

    .p = PRODUCT_ID,
    .m = MODEL_NAME,

    .magic = 0x12345678,
};

T_SW_RESET_REASON reset_reason_8762e(void)
{
    T_SW_RESET_REASON sw_reset_type = __rtl_reset_reason_get();
    uint32_t wdg_reset_lr = (__rtl_btaon_fast_read_safe(0x1c6) << 16) | (__rtl_btaon_fast_read_safe(0x1c4));

    if (wdg_reset_lr & 0xffff0000) {
        if (sw_reset_type == RESET_REASON_HW) {
            sw_reset_type = RESET_REASON_WDG_TIMEOUT;
        }
    } else {
        sw_reset_type = RESET_REASON_HW;
    }

    return sw_reset_type;
}

int main(int argc, FAR char *argv[])
{
    int err;

    printk("Model Name %s PID %ld Develop Version %d\n",
            mi_config.cfg.model_name, mi_config.cfg.pid, mi_config.cfg.dev_version);

    err = wdg_init();
    if (err) {
        printk("watchdog init failed (err %d)\n", err);
        return err;
    }
#if defined(CONFIG_MIBLE_USE_MCU_OTA)
    if(mi_config.cfg.init.mcu_ota_init){
        mi_config.cfg.init.mcu_ota_init();
    }
    err =  mible_mcu_init();
    printk("mcu ota init (err %d)\n", err);

    if(err == 0){
        uint32_t delay = 0;
        uint8_t buf_ver[4] = {0};
        /*recommend to use delayed work to read mcu version;
        *  just use sync mode to read for demo
        */
        mible_mcu_send_get_info(&delay);
        mible_mcu_read_get_info(buf_ver);

        //mcu version report timer
        err = miio_timer_create(&mcu_ver_report_timer,
                main_mcu_version_report_handler,
                MIBLE_TIMER_SINGLE_SHOT);
        if (err < 0) {
            printk("Unable to create mcu ver report timer\n");
        }
    }
#endif

    err = board_init();
    if (err) {
        printk("board init failed (err %d)\n", err);
        return err;
    }

    extern int zblue_main(void);
    err = zblue_main();
    if (err) {
        printk("zblue init failed (err %d)\n", err);
        return err;
    }

    err = bt_enable(NULL);
    if (err) {
        printk("Bluetooth init failed (err %d)\n", err);
        return err;
    }

    err = mible_service_init();
    if (err) {
        printk("mi service init failed (err %d)\n", err);
        return err;
    }

    err = mible_mesh_start();
    if (err) {
        printk("mesh start failed (err %d)\n", err);
        return err;
    }
    bt_le_scan_cb_register(&ext_scan_cb);

    if (light_flash_restore()) {
        printk("miio_system_restore\n");
        /* Call restore later, since mijia uninit yet.  */
        err = miio_timer_create(&reset_timer,
                    node_restore_timer_handler,
                    MIBLE_TIMER_SINGLE_SHOT);
        if (err) {
            printk("Unable to create restore timer");
            return err;
        }

        /* Indicate system restore in progress. */
        miio_timer_start(reset_timer, 1000, NULL);
    }

    err = miio_timer_create(&app_handle, app_periodic_handler,
                 MIBLE_TIMER_REPEATED);
    if (err) {
        printk("Unable to create app timer");
        return err;
    }

    miio_timer_start(app_handle, 5000, NULL);

#if defined(CONFIG_BT_MESH_STATISTIC)
    mible_trace_update_reboot_reason(reset_reason_8762e());
    mible_trace_init();
#endif

    while (1) {
        mible_events_process();
    }

    return 0;
}
